xml/DataProcessors/ЗагрузкаОтчетаВТБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаОтчетаВТБ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокСделок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСделки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСделки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСделки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

xml/DataProcessors/ЗагрузкаОтчетаВТБ/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗагрузитьНаСервере(ЗагруженоСделок, ВсегоСделок)

	ИмяФайла = "C:\Users\Andrey\Documents\1C\МоиАктивы\ЗагрузкаXML\GetBrokerReport.xml";
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗагрузитьОтчет(ИмяФайла, БрокерскийСчет, ЗагруженоСделок, ВсегоСделок);
		

КонецПроцедуры


&НаСервере
Процедура ЗагрузитьНаСервереРаботаетСВТБ()

	ИмяФайла = "C:\Users\Andrey\Documents\1C\МоиАктивы\ЗагрузкаXML\GetBrokerReport.xml";
	
	ЧтениеТекста = Новый ЧтениеТекста(ИмяФайла, КодировкаТекста.UTF8);
	СтрокаXML = ЧтениеТекста.Прочитать();
	
	//СтрокаXML = СтрЗаменить(СтрокаXML,"<PurchaseOrder","<PurchaseOrder xmlns=""http://www.microsoft-demo-liquid.com""");	
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	
	Пакет=ФабрикаXDTO.Пакеты.Получить("report577p_v1");
	СвойствоReport=Пакет.КорневыеСвойства.Получить("Report");	
		//PurchaseOrder = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, СвойствоPurchaseOrder.Тип);
	
	Report = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, СвойствоReport.Тип);
	
	Объект.СписокСделок.Очистить();	
	
	// Список сделок
	Для каждого Сделка Из Report.ЗавершенныеСделки.СписокСделок.Сделка Цикл
	
		НоваяСтрока=Объект.СписокСделок.Добавить();
		НоваяСтрока.Инструмент  = Сделка.Инструмент;
		НоваяСтрока.ТипСделки = Сделка.ТипСделки;
		НоваяСтрока.ДатаСделки = Сделка.ДатаСделки;
		НоваяСтрока.Количество = Сделка.Количество;
		НоваяСтрока.Цена = Сделка.Цена;
		НоваяСтрока.СуммаСделки = Сделка.СуммаСделки;
	
	КонецЦикла; 
	
	

КонецПроцедуры
 

&НаСервереБезКонтекста
Процедура ЗагрузитьНаСервереРаботающийПример()
	ИмяФайла = "C:\Users\Andrey\Documents\1C\МоиАктивы\ЗагрузкаXML\microsoft-demo.xml";
	
	ЧтениеТекста = Новый ЧтениеТекста(ИмяФайла, КодировкаТекста.UTF8);
	СтрокаXML = ЧтениеТекста.Прочитать();
	
	СтрокаXML = СтрЗаменить(СтрокаXML,"<PurchaseOrder","<PurchaseOrder xmlns=""http://www.microsoft-demo-liquid.com""");	
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	СписокСделок = Новый Массив;
	
	// Если описаны типы то так
	//ТипPurchaseOrder = ФабрикаXDTO.Тип("http://www.microsoft-demo-liquid.com", "Type_PurchaseOrder");
	//
	//ИPurchaseOrder = ТипPurchaseOrder.Свойства Свойства.Получить("PurchaseOrder").Тип;
	// Если описаны свойства, то так
	 Пакет=ФабрикаXDTO.Пакеты.Получить("http://www.microsoft-demo-liquid.com");
	СвойствоPurchaseOrder=Пакет.КорневыеСвойства.Получить("PurchaseOrder");	
		//PurchaseOrder = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, СвойствоPurchaseOrder.Тип);
	
	PurchaseOrder = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, СвойствоPurchaseOrder.Тип);
	
	ДатаПоставки = PurchaseOrder.OrderDate;
	
	Для каждого Адрес Из PurchaseOrder.Address Цикл
	
		Город = Адрес.City;	
	
	КонецЦикла;
	
	
	
	//Для каждого Item Из PurchaseOrder.Items Цикл
	//
	//	НазваниеПродукта = Item.ProductName;	
	//
	//КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагруженоСделок=0;
	ВсегоСделок=0;
	ЗагрузитьНаСервере(ЗагруженоСделок, ВсегоСделок);
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Загрузка окончена. Загружено сделок "+ЗагруженоСделок+". Всего сделок "+ВсегоСделок;
	//Сообщение.Поле = "";
	//Сообщение.УстановитьДанные();
	Сообщение.Сообщить(); 
КонецПроцедуры
